Revit 2027 API
Document.FamilyCreate Property
An object that can be used to create new instances of Autodesk Revit API elements within a family document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyItemFactory FamilyCreate { get; }
Public ReadOnly Property FamilyCreate As FamilyItemFactory
	Get
public:
property FamilyItemFactory^ FamilyCreate {
	FamilyItemFactory^ get ();
}
member FamilyCreate : FamilyItemFactory with get
Property Value
FamilyItemFactory
This object is used to create new instances of family elements within the Autodesk Revit API, such as Extrusion or Reference lines.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the current document is project document.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace